paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
	lv_obj_t* Tx_ledlabel = lv_label_create(bg_middle, NULL);
	lv_obj_align(Tx_ledlabel, Tx_led1, LV_ALIGN_OUT_TOP_MID, 7, 0);
	lv_label_set_text(Tx_ledlabel, "TX");

	// Keep de order of the focus correct
	lv_group_add_obj(vfo_group, lsb_button);
	lv_group_add_obj(vfo_group, usb_button);
	lv_group_add_obj(vfo_group, vfo1_button);
	lv_group_add_obj(vfo_group, vfo2_button);
	lv_group_add_obj(vfo_group, Band_btn);
	lv_group_add_obj(vfo_group, save_button);

	// TX objects shown when VFO is in TX mode
	static lv_color_t needle_colors[1];
	needle_colors[0] = LV_COLOR_ORANGE;
	
	static lv_style_t gauge_style;
	lv_style_init(&gauge_style);
	lv_style_set_bg_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_BLACK);
	lv_style_set_line_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_WHITE);
	lv_style_set_scale_end_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_RED);
	lv_style_set_text_color(&gauge_style, LV_STATE_DEFAULT, LV_COLOR_WHITE);
	lv_style_set_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_border_side(&gauge_style, LV_STATE_DEFAULT, LV_BORDER_SIDE_NONE);
	lv_style_set_scale_end_line_width(&gauge_style, LV_STATE_DEFAULT, 2);
	lv_style_set_scale_end_border_width(&gauge_style, LV_STATE_DEFAULT, 2);

	Swr_gauge = lv_gauge_create(bg_middle, NULL);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_MAJOR, &gauge_style);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_MAIN, &gauge_style);
	lv_obj_add_style(Swr_gauge, LV_GAUGE_PART_NEEDLE, &gauge_style);
	lv_obj_align(Swr_gauge, NULL, LV_ALIGN_CENTER, 100, 45);
	lv_gauge_set_needle_count(Swr_gauge, 1, needle_colors);
	lv_obj_set_size(Swr_gauge, 160, 160);
	lv_gauge_set_range(Swr_gauge, 0, 100);
	int line_cnt, label_cnt = 5, sub_div = 3;
	line_cnt = (sub_div + 1) * (label_cnt - 1) + 1;
	lv_gauge_set_scale(Swr_gauge, 270, line_cnt, label_cnt);
	lv_gauge_set_critical_value(Swr_gauge, 40);
	lv_gauge_set_angle_offset(Swr_gauge,0);
	/*Allow recoloring of the images according to the needles' color*/
	lv_gauge_set_formatter_cb(Swr_gauge, lv_gauge_format_swr);
	lv_obj_set_style_local_image_recolor_opa(Swr_gauge, LV_GAUGE_PART_NEEDLE, LV_STATE_DEFAULT, LV_OPA_COVER);
	
	lv_obj_t* swr_label = lv_label_create(Swr_gauge, NULL);
	lv_obj_align(swr_label, Swr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -15);
	lv_label_set_text(swr_label, "Swr");
	lv_obj_set_hidden(Swr_gauge, true);
	swr_vlabel = lv_label_create(Swr_gauge, NULL);
	lv_obj_align(swr_vlabel, Swr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -30);
	lv_label_set_text(swr_vlabel, "0.0");
	lv_obj_set_hidden(Swr_gauge, true);

	pwr_gauge = lv_gauge_create(bg_middle, NULL);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_MAJOR, &gauge_style);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_MAIN, &gauge_style);
	lv_obj_add_style(pwr_gauge, LV_GAUGE_PART_NEEDLE, &gauge_style);
	lv_obj_align(pwr_gauge, NULL, LV_ALIGN_CENTER, -65, 45);
	lv_gauge_set_needle_count(pwr_gauge, 1, needle_colors);
	lv_obj_set_size(pwr_gauge, 160, 160);
	lv_gauge_set_range(pwr_gauge, 0, R.scale_watt *10);
	label_cnt = 5; sub_div = 3;
	line_cnt = (sub_div + 1) * (label_cnt - 1) + 1;
	lv_gauge_set_scale(pwr_gauge, 270, line_cnt, label_cnt);
	lv_gauge_set_critical_value(pwr_gauge, (R.scale_watt * 10));
	lv_gauge_set_angle_offset(pwr_gauge, 0);
	lv_gauge_set_formatter_cb(pwr_gauge, lv_gauge_format_pwr);
	/*Allow recoloring of the images according to the needles' color*/
	lv_obj_set_style_local_image_recolor_opa(pwr_gauge, LV_GAUGE_PART_NEEDLE, LV_STATE_DEFAULT, LV_OPA_COVER);
	lv_obj_t* pwr_label = lv_label_create(pwr_gauge, NULL);
	lv_obj_align(pwr_label, pwr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -15);
	lv_label_set_text(pwr_label, "Watt");
	pwr_vlabel = lv_label_create(pwr_gauge, NULL);
	lv_obj_align(pwr_vlabel, pwr_gauge, LV_ALIGN_IN_BOTTOM_MID, 0, -30);
	lv_label_set_text(pwr_vlabel, "0.0");
	lv_obj_set_hidden(pwr_gauge, true);

	gui_setup(scr);
	gui_si5351(scr);
	init_wifi_gui(scr);
	init_cal_ad8307_gui(scr);

	BfoLabel(get_bfo(active_vfo) / 100, 0);
	setfrequencylabel(get_vfo_frequency(active_vfo), get_vfo_frequency(1 - active_vfo));
	ToggleVfo(active_vfo, 0);

	// Set default focus to band selector
	lv_indev_set_group(encoder_indev_t, vfo_group); 
	lv_group_focus_obj(usb_button);

	xSemaphoreGive(GuiBinarySemaphore);
	int tt = 0;
	while (1) {
/*
* Call the lv_task_handler to process GUI changes
* Semaphores are there for thread save GUI changes from other threads
* lv_task_handler should not be executed if other tasks change the GUI
*/
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
		lv_task_handler();
		xSemaphoreGive(GuiBinarySemaphore);
		int count = Enc_vfo.getCount();
		if (count != 0)
		{
/*
* Translate the encoder movement to a new frequency
* If the band is changed also update the band roller
*/
			char str[32];
			long frq = set_encoder_count_to_vfo_frequency(count, active_vfo);
			Enc_vfo.clearCount();
			setfrequencylabel(frq, get_vfo_frequency(1 - active_vfo));
			uint16_t i = get_band(str);
			lv_label_set_text(Band_btn_label, str);
		}
/*
* Process rotary press button messages
*/
		rotary_button.check();
		smeter->Draw(get_smeter());
		
		static volatile int lastPowerEncoding;
		static	bool	hide_rx = true;
		if ((f_rxtx) && (f_cal_ad8307 == false))
		{
			if (hide_rx == false)
			{
				hide_rx = true;		
				smeter->hide(true);
				lv_obj_set_hidden(Swr_gauge, false);
				lv_obj_set_hidden(pwr_gauge, false);
			}
			pswr_sync_from_interrupt();
			calc_SWR_and_power();
			int currMillis = millis();
			if (currMillis - lastPowerEncoding > POLL_TIMER)
			{
				uint16_t swr, pep;


				swr = print_swr();
				pep = (uint16_t) (power_mw_pep / 100.0);
				lv_gauge_set_value(Swr_gauge, 0, swr/10);
				lv_gauge_set_value(pwr_gauge, 0, pep);
				char buf[32];
				sprintf(buf,"1:%d.%d", swr / 100, (swr / 10) % 10);
				lv_label_set_text(swr_vlabel, buf);
				print_p_mw(power_mw_pep);
				lv_label_set_text(pwr_vlabel, lcd_buf);
				//lv_label_set_text(pwr_vlabel, String((double)power_mw_pep / 1000.0).c_str());
				//Serial.println("SWR: " + String(swr) + " Power: " + String(power_mw_pep));
				lastPowerEncoding = currMillis;
			}

