paulh002/VFO-ESP32-Si5351/vfo_esp32_si5351/gui.cpp
		}
		else
		{
			if (hide_rx == true)
			{
				hide_rx = false;
				smeter->hide(false);
				lv_obj_set_hidden(Swr_gauge, true);
				lv_obj_set_hidden(pwr_gauge, true);
			}
		}
		if (f_cal_ad8307)
		{
			uint8_t inputq = check_input_cal();
			lv_color_t color_t = LV_COLOR_RED;
			String	sStr;

			switch (inputq)
			{
			case CAL_FWD:
				color_t = LV_COLOR_GREEN;
				sStr = String("Power Ok:");
				break;
			case CAL_REV:
				color_t = LV_COLOR_ORANGE;
				sStr = String("Power rev:");
				break;
			case CAL_BAD:
				color_t = LV_COLOR_RED;
				sStr = String("Power Low:");
				break;
			}
			uint16_t fwd, rev;

			fwd = analogRead(FWD_METER);
			rev = analogRead(REV_METER);
			updateBottomStatus(color_t, String(sStr + " Fwd: " + String(adc_ref * ((double)fwd / 4096.0)) + "V Rev: " + String(adc_ref * ((double)rev / 4096.0))).c_str(),0);
		}
		vTaskDelay(1);
	}
}

static void rotary_button_eventhandler(AceButton*, uint8_t eventType, uint8_t buttonState)
{
	switch (eventType) {
	case AceButton::kEventLongPressed:
		ToggleSetup(true);
		enc_button_state = LV_INDEV_STATE_REL;
		break;
	case AceButton::kEventPressed:
		enc_button_state = LV_INDEV_STATE_PR;
		break;

	case AceButton::kEventReleased:
		enc_button_state = LV_INDEV_STATE_REL;
		break;
	}
}


// Callbacks

/* Display flushing */
void my_disp_flush(lv_disp_drv_t* disp, const lv_area_t* area, lv_color_t* color_p)
{
	uint16_t c;

	tft.startWrite(); /* Start new TFT transaction */
	tft.setAddrWindow(area->x1, area->y1, (area->x2 - area->x1 + 1), (area->y2 - area->y1 + 1)); /* set the working window */
	for (int y = area->y1; y <= area->y2; y++) {
		for (int x = area->x1; x <= area->x2; x++) {
			c = color_p->full;
			tft.writeColor(c, 1);
			color_p++;
		}
	}
	tft.endWrite(); /* terminate TFT transaction */
	lv_disp_flush_ready(disp); /* tell lvgl that flushing is done */
}

bool my_touchpad_read(lv_indev_drv_t* indev_driver, lv_indev_data_t* data)
{
	uint16_t touchX, touchY;

	bool touched = tft.getTouch(&touchX, &touchY, 600);

	if (tft.getRotation() == 1)
	{
		touchX = screenWidth - touchX;
	}

	if (!touched)
	{
		return false;
	}

	if (touchX > screenWidth || touchY > screenHeight)
	{
		Serial.println("Y or y outside of expected parameters..");
		Serial.print("y:");
		Serial.print(touchX);
		Serial.print(" x:");
		Serial.print(touchY);
	}
	else
	{

		data->state = touched ? LV_INDEV_STATE_PR : LV_INDEV_STATE_REL;

		/*Save the state and save the pressed coordinate*/
		//if(data->state == LV_INDEV_STATE_PR) touchpad_get_xy(&last_x, &last_y);

		/*Set the coordinates (if released use the last pressed coordinates)*/
		data->point.x = touchX;
		data->point.y = touchY;

	/*	Serial.print("Data x");
		Serial.println(touchX);

		Serial.print("Data y");
		Serial.println(touchY);
	*/
	}

	return false; /*Return `false` because we are not buffering and no more data to read*/
}

static void mode_button_eh(lv_obj_t* obj, lv_event_t event)
{
 if (event == LV_EVENT_PRESSED)
	{	
		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		//Serial.println(String("state checked:") + String(bchecked));

		if (obj == usb_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(lsb_button, LV_STATE_CHECKED);
				switch_mode(MODE_USB, active_vfo);
			}
			else
			{
				lv_obj_add_state(lsb_button, LV_STATE_CHECKED);
				switch_mode(MODE_LSB, active_vfo);
			}
		}
		if (obj == lsb_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(usb_button, LV_STATE_CHECKED);
				switch_mode(MODE_LSB, active_vfo);
			}
			else
			{
				lv_obj_add_state(usb_button, LV_STATE_CHECKED);
				switch_mode(MODE_USB, active_vfo);
			}
		}
	}
}

static void mode_button_vfo(lv_obj_t* obj, lv_event_t event)
{
	/*if (event == LV_EVENT_CLICKED) {
		//printf("Clicked\n");
	}
	else */  
	if (event == LV_EVENT_PRESSED /*LV_EVENT_VALUE_CHANGED*/) {

		bool bchecked = lv_btn_get_state(obj) & LV_STATE_CHECKED;
		//Serial.println(String("state vfo checked:") + String(bchecked));

		if (obj == vfo1_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(vfo2_button, LV_STATE_CHECKED);
				active_vfo = 0;
			}
			else
			{
				lv_obj_add_state(vfo2_button, LV_STATE_CHECKED);
				active_vfo = 1;
			}
		}
		if (obj == vfo2_button)
		{
			if (bchecked)
			{
				lv_obj_clear_state(vfo1_button, LV_STATE_CHECKED);
				active_vfo = 1;
			}
			else
			{
				lv_obj_add_state(vfo1_button, LV_STATE_CHECKED);
				active_vfo = 0;
			}
		}
		long frq = switch_vfo(active_vfo);
		setfrequencylabel(frq, get_vfo_frequency(1 - active_vfo));
	}
}

void updateBottomStatus(lv_color_t color, String text, uint8_t sem) {
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	lv_obj_set_style_local_bg_color(bg_top, LV_OBJ_PART_MAIN, LV_STATE_DEFAULT, color);
	lv_label_set_text(label_status, text.c_str());
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

void showWifilabel(bool show) {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	lv_obj_set_hidden(label_wifi, show);
	xSemaphoreGive(GuiBinarySemaphore);
}


// this function is used to set the display frequency, it is not using semaphore because this is done from main loop
void setfrequencylabel(long freq, long freq2, uint8_t sem) {
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	char str[80];

	sprintf(str, "%3d.%03d,%02d", freq / 1000000, (freq / 1000) % 1000, (freq / 10) % 100);
	lv_label_set_text(vfo_frequency, str);
	
	sprintf(str, "%3d.%03d,%02d", freq2 / 1000000, (freq2 / 1000) % 1000, (freq2 / 10) % 100);
	lv_label_set_text(vfo2_frequency, str);
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

static void event_band_button(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_PRESSED) {
		char	buf[80];
		long	frq;

		strcpy(buf, lv_label_get_text(Band_btn_label));
		buf[2] = '\0';
		frq = band_select_next(buf, active_vfo);
		setfrequencylabel(frq, get_vfo_frequency(1 - active_vfo));
		set_vfo_frequency(frq, active_vfo);
		lv_label_set_text(Band_btn_label, buf);
	}
}

void ToggleTX(uint8_t show) {
	xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (show)
		lv_led_on(Tx_led1);
	else
		lv_led_off(Tx_led1);
	xSemaphoreGive(GuiBinarySemaphore);
}


static void event_button_save(lv_obj_t* btn, lv_event_t e)
{
	if (e == LV_EVENT_SHORT_CLICKED || e == LV_EVENT_LONG_PRESSED_REPEAT) {
		save_vfo();
		SaveEEPROM();
	}
}

void ToggleSetup(bool show, uint8_t sem) 
{
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (show)
	{
		lv_obj_move_foreground(bg_middle2);
		lv_indev_set_group(encoder_indev_t, setup_group);
		lv_group_focus_obj(btn_matrix);
	}
	else
	{
		lv_obj_move_background(bg_middle2);
		lv_indev_set_group(encoder_indev_t, vfo_group);
		lv_group_focus_obj(lsb_button);
	}
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

void BfoLabel(uint32_t num, uint8_t sem) {
	if (sem)
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	char str[32];
	sprintf(str, "Bfo: %ld.%ld Khz", num / 10, num % 10);
	lv_label_set_text(bfo_label, str);
	//lv_spinbox_set_value(bfo_spinbox, num);
	if (sem)
		xSemaphoreGive(GuiBinarySemaphore);
}

void Togglemode(int mode, uint8_t sem)
{
	if (sem)
		xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY); 
	if (mode == MODE_LSB)
	{
		lv_btn_set_state(lsb_button, LV_BTN_STATE_CHECKED_RELEASED);
		lv_btn_set_state(usb_button, LV_BTN_STATE_RELEASED);
	}
	if (mode == MODE_USB)
	{
		lv_btn_set_state(usb_button, LV_BTN_STATE_CHECKED_RELEASED);
		lv_btn_set_state(lsb_button, LV_BTN_STATE_RELEASED);
	}
	if (sem)
		xSemaphoreGive(GuiBinarySemaphore);
}

void ToggleVfo(int active_vfo, uint8_t sem)
{
	if (sem) xSemaphoreTake(GuiBinarySemaphore, portMAX_DELAY);
	if (active_vfo)
	{
		lv_obj_add_state(vfo2_button, LV_STATE_CHECKED);
		lv_obj_clear_state(vfo1_button, LV_STATE_CHECKED);
	}
	else
	{
		lv_obj_add_state(vfo1_button, LV_STATE_CHECKED);
		lv_obj_clear_state(vfo2_button, LV_STATE_CHECKED);
	}
	if (sem) xSemaphoreGive(GuiBinarySemaphore);
}

static void gui_setup_event_handler(lv_obj_t* obj, lv_event_t event)
{
	if (event == LV_EVENT_VALUE_CHANGED) {
		uint16_t abutton = lv_btnmatrix_get_active_btn(obj);
		switch (abutton)
		{
		case 0:
			show_wifi_gui(true);
			break;
		case 1:
			//Si5351 calibration
			lv_obj_move_foreground(bg_middle3);
			lv_indev_set_group(encoder_indev_t, si_5351_group);
			start_cal();
			break;
		case 2:
			lv_obj_move_foreground(bg_calgui);
			lv_obj_move_foreground(bg_top_cal);
			lv_indev_set_group(encoder_indev_t, cal_group);
			start_ad8307_cal();
			break;
		case 3:
			memset(&R, 0, sizeof(R));
			init_vfo();
			SaveEEPROM();
			ESP.restart();
			break;
		}
		
